web/src/test/resources/integrationtest/prediktion/getPrediktionRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:clinicalprocess:healthcond:srs:GetSRSInformationResponder:3" xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:types:2">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:GetSRSInformationRequest>
         <urn:version>1</urn:version>
         <urn:konsument-id>
            <urn1:root>1.2.752.129.2.1.4.1</urn1:root>
            <urn1:extension>123456</urn1:extension>
         </urn:konsument-id>
         <urn:anvandare-id>
            <urn1:root>1.2.752.129.2.1.4.1</urn1:root>
            <urn1:extension>98765</urn1:extension>
         </urn:anvandare-id>
         <!--Optional:-->
         <urn:prediktionsfaktorer>
            <urn:postnummer>12345</urn:postnummer>
            <!--1 or more repetitions:-->
            <urn:fragasvar>
               <urn:frageid-srs>abc</urn:frageid-srs>
               <urn:svarsid-srs>def</urn:svarsid-srs>
            </urn:fragasvar>
         </urn:prediktionsfaktorer>
         <urn:individer>
            <urn:individ>
               <urn:person-id>197308051234</urn:person-id>
               <urn:diagnos>
                  <urn1:code>diagnosis_placeholder</urn1:code>
                  <urn1:codeSystem>1.2.752.116.1.1.1.1.3</urn1:codeSystem>
               </urn:diagnos>
               <urn:intyg-id>
                  <urn1:root>root</urn1:root>
                  <urn1:extension>intygsid_placeholder</urn1:extension>
               </urn:intyg-id>
            </urn:individ>
         </urn:individer>
         <urn:utdatafilter>
            <urn:prediktion>true</urn:prediktion>
            <urn:atgardsrekommendation>false</urn:atgardsrekommendation>
            <urn:statistik>false</urn:statistik>
         </urn:utdatafilter>
      </urn:GetSRSInformationRequest>
   </soapenv:Body>
</soapenv:Envelope>